export default [
  {
    version: 'v1.5',
    list: [
      '積分表同分時，選手顯示順序會依照勝率由高到低排序',
      '超過三個月未出賽的選手，將凍結使用者的資料無法被查詢',
    ],
  },
  {
    version: 'v1.4',
    list: [
      'Logo 圖示更換',
    ],
  },
  {
    version: 'v1.3',
    list: [
      '休賽中的選手在積分表中依然會顯示',
    ],
  },
  {
    version: 'v1.2',
    list: [
      '增加選手頁面',
      '積分表可以點擊選手名稱來查看選手的資訊',
      '修正積分賽記錄有時候不會正常顯示的問題',
    ],
  },
  {
    version: 'v1.1',
    list: [
      '積分賽記錄增加搜尋賽事名稱的選項',
    ],
  },
  {
    version: 'v1.0',
    list: [
      '積分賽記錄修正會跳出錯誤',
      '積分賽記錄預設搜尋最近 7 日的記錄',
      '積分賽記錄的表格更新，表格的 # 可以排序，預設是從日期最新的排序',
      '積分賽記錄增加分頁功能',
      '積分表在手機版左右拖移時，選手名稱會被遮住',
    ],
  },
  {
    version: 'v1.0',
    list: [
      '增加更新日誌',
      '積分賽記錄的日期選擇與按鈕調整',
      '積分賽記錄增加選手的搜尋欄位',
      '積分表可以點擊排名來查詢選手的積分賽記錄',
    ],
  },
  {
    version: 'v0.2',
    list: [
      '積分表增加欄位「積分更新時間」',
      '積分表超過 60 日未比賽時隱藏該選手的排名',
      '積分表手機版左右拖移時，固定選手欄位',
    ],
  },
];
